[Killed] LogicalOperator
veille/stryker/src/math.ts:5:10
   num1: number | undefined,
   num2: number | undefined
 ) => {
-  return num1 && num2 ? num1 + num2 : undefined;
+  return num1 || num2 ? num1 + num2 : undefined;
 };
 
killedBy: All tests
statusReason: Debugger attached.

npm
 


> stryker@1.0.0 test /Users/mikael.bouchez/Works/veille/stryker/.stryker-tmp/sandbox7199560
